# Отчёт по лабораторной работе №14

---

## по курсу "Фундаментальная информатика"


Студент группы М8О-108Б-23 Романов Вадим Михайлович

Работа выполнена

Преподаватель: каф.806 Севастьянов Виктор Сергеевич

1. Тема: вложенные циклы с параметром. Обход и линеаризация матриц.
2. Цель работы: составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода).
3. Задание: прочитать мою матрицу по "внешней" спирали по часовой стрелке, начиная с верхнего правого угла(см. задание 27).
4. Идея, метод, алгоритм решения задачи:
  Моя идея состояла в том, чтобы забить на всякую арифметику и тупо решать задание через циклы. Для каждой стороны матрицы я делал свой цикл for. Для сигнала СТОП я использовал цикл while. Стоит отметить, что я разделил выполнение циклов для матриц чётного и нечётного размеров для простоты отладки и читабельности кода.
5. Сценарий выполнения работы:
   Тесты я заготовил в самом коде и введу их уже на защите.
 - счтиать матрицу через клавиатуру и поместить её в двухмерный массив;
  Далее работа циклов для чётных и нечётных матриц будет похожа
 - перед началом вывода данных обозначить центр матрицы и обозначить вспомогательные для циклов переменные;
 - далее нужно пройтись по каждой стороне матрицы, выводя все данные;
 - для перехода на уровень глубже составить новые координаты начала поездки;
 - дойти до центра матрицы, вывести и его на экран и закончить работу программы.
6. Протокол:
```c
#include<stdio.h>
#include<math.h>


int main(){
    int matrix[100][100];
    int size, i, j, pr_i, pr_j, const_i, const_j;
    int numbers[10000];
    scanf("%d", &size);
    for (i = 1; i <= size; i++)
    {
        for (j = 1; j <= size; j++)
        {
            scanf("%d", &matrix[i][j]);
            numbers[i*j] = matrix[i][j];
        }
    }

    int count = 0, increment = 0;
    while (count < pow(size, 2))
    {
        if (size % 2 == 1)
        {   
            const_i = (size / 2) + (size % 2);
            const_j = (size / 2) + (size % 2);
            i = 0;
            j = size;
            increment = 0;
            while (count <= pow(size, 2) - 1)
            {
                for (i = i + 1; i <= size - increment; i++)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                i --;
                
                for (j = j - 1; j >= increment + 1; j--)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                j ++;

                for (i = i - 1; i >= increment + 1; i--)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                i ++;

                for (j = j + 1; j <= size - increment - 1; j++)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                j --;
                increment ++;
            }
        }
        
        else
        {
            const_i = (size / 2) + (size % 2);
            const_j = (size / 2) + (size % 2);
            i = 0;
            j = size;
            increment = size - const_i;
            while (count <= pow(size, 2) - 4)
            {
                for (i = i + 1; i <= const_i + increment; i++)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                i --;

                for (j = j - 1; j >= const_j - increment + 1; j--)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                j ++;

                for (i = i - 1; i >= const_i - increment + 1; i--)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                i ++;

                for (j = j + 1; j <= const_i + increment - 1; j++)
                {
                    printf("%d ", matrix[i][j]);
                    count ++;
                }
                j --;
                increment --;
            }
        }   
    }
}
```
8. Выводы: только после окончательной отладки программы я понял, что всё это время делал не тот номер. Надеюсь, вы не подумаете, что я у кого-то эту жесть списал или кто-то это делал у меня. Если успею, программу переделаю, но я вряд ли на такое решусь. Полчаса спустя я всё переделал. Теперь программа делает то, что должна.